dotNet/prism.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Prism - Composite Applications in C#</title>
<!-- 2016-02-18 Thu 20:50 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">Prism - Composite Applications in C#</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Addressing The Challenges of MVVM</a>
<ul>
<li><a href="#sec-1-1">Challenges of MVVM</a>
<ul>
<li><a href="#sec-1-1-1">Dependency Injection</a></li>
<li><a href="#sec-1-1-2">Bootstrapping</a></li>
<li><a href="#sec-1-1-3">Component Communications</a></li>
</ul>
</li>
<li><a href="#sec-1-2">Hello Prism</a></li>
</ul>
</li>
<li><a href="#sec-2">Dependency Injection</a>
<ul>
<li><a href="#sec-2-1">Dependency Injection and Inversion of Control</a></li>
<li><a href="#sec-2-2">Prism and the UnityContainer</a></li>
<li><a href="#sec-2-3"><span class="todo TODO">TODO</span> A More Realistic Example</a></li>
<li><a href="#sec-2-4">Summary of Dependency Injection</a></li>
</ul>
</li>
<li><a href="#sec-3">Bootstrapper</a>
<ul>
<li><a href="#sec-3-1">The bootstrapper</a>
<ul>
<li><a href="#sec-3-1-1"><span class="todo TODO">TODO</span> Add mp4</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Addressing The Challenges of MVVM</h2>
<div class="outline-text-2" id="text-1">
<p>
Those of you who have read my Blog before will know I am a WPF
developer and have posted Blog articles on MVVM (Model View
View-Model). MVVM is a very good way to develop WPF applications. As
it encourages separation of concerns to allow higher unit test
coverage for UI behaviour, better Developer-Designer workflow and is
generally a great pattern for use with WPF. If you want to know a
bit more about MVVM, check out this post.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Challenges of MVVM</h3>
<div class="outline-text-3" id="text-1-1">
<p>
As many people will tell you, MVVM is a pattern, not a
framework. What I mean by that is that MVVM is conceptual; it is
more a way of thinking about designing an application than a set of
libraries that assist in achieving the benefits listed above. The
main challenge of applying MVVM is managing and constructing an
application efficiently and consistently.
</p>

<p>
When applying MVVM to an application, typically the following areas
will need to be addressed by the developer:
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">Dependency Injection</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
How do we manage injecting dependencies in order to maintain loose
coupling through Inversion of Control. If we don’t address this we
may still end up with an MVVM app, but one that is not as loosely
coupled as we would want it, making unit test writing a challenge.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">Bootstrapping</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
How do we manage the wire up of our various Views and View Models
for example? How do we initialize Models and where do we
initialize Models?
</p>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3">Component Communications</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
How do we manage communication between components and not create
dependencies between components.
</p>

<p>
These are just some of the challenges that MVVM presents.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Hello Prism</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Prism, formerly known as ‘Composite Application Guidance for WPF
and Silverlight’ is a set of guidance and libraries for developing
WPF/Silverlight/Windows Phone applications that not only assists in
addressing the challenges outlined above but also provides a
comprehensive set of features for developing applications that are
rich, flexible and easy to maintain. There is a huge amount of good
documentation in the Prism pages on MSDN, what I intend to cover
here is a summary of the basic features that Prism offers. In part
2, I shall be using my WPF Media Player application as an example
and later provide a complete slide based presentation as I did with
MVVM.
</p>

<p>
As tempted as I am to copy and paste from the MSDN documentation,
it is probably best now to direct you to <a href="http://msdn.microsoft.com/en-us/library/ff921153(v=PandP.40).aspx">here</a> to look at a
comprehensive overview of Prism. I would encourage you to read the
following sections in particular:
</p>

<ul class="org-ul">
<li>Client Application Development Challenges
</li>
<li>The Composite Approach
</li>
<li>Prism Key Concepts
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Dependency Injection</h2>
<div class="outline-text-2" id="text-2">
<p>
For those familiar with Prism, it may seem odd to start with
Dependency Injection when dealing with a framework that is designed
for modular development. However, Prism is a very large beast and
taking it on wholesale can be both daunting and frankly
unneccessary. What I intend to do with the remaining sections is
deal with problems frequently encountered when developing MVVM based
applications, look at how Prism attempts to solve them and put
forward some alternatives, which will probably not be comprehensive,
and weigh up the pros and cons of each approach.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Dependency Injection and Inversion of Control</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The two terms DI (Dependency Injection) and IoC (Inversion of
Control) are two terms that are often used together and not without
good reason as the following example will show.
</p>

<div class="org-src-container">

<pre class="src src-csharp"><span class="linenr"> 1: </span>public class A
<span class="linenr"> 2: </span>{
<span class="linenr"> 3: </span> public A()
<span class="linenr"> 4: </span> {
<span class="linenr"> 5: </span> }
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span> public void DoSomethingElse()
<span class="linenr"> 8: </span> {
<span class="linenr"> 9: </span> }
<span class="linenr">10: </span>}
<span class="linenr">11: </span>public class B
<span class="linenr">12: </span>{
<span class="linenr">13: </span> A _a;
<span class="linenr">14: </span>
<span class="linenr">15: </span> public B()
<span class="linenr">16: </span> {
<span class="linenr">17: </span>  _a = new A();
<span class="linenr">18: </span> }
<span class="linenr">19: </span>
<span class="linenr">20: </span> public void DoSomething()
<span class="linenr">21: </span> {
<span class="linenr">22: </span>  _a.DoSomethingElse();
<span class="linenr">23: </span> }
<span class="linenr">24: </span>}
</pre>
</div>

<p>
This is of course a very simple example, but there still exists
issues:
</p>

<ol class="org-ol">
<li>Class B controls the creation of object _a.
</li>
<li>There is a tight coupling between type A and B, due to class B
containing a reference to A.
</li>
<li>There is a dependence in B on the type A, so as we add new add
classes that derive from A, B will need to know about them.
</li>
</ol>

<p>
This has implications for testing and maintanance, but is very simple
to fix, by allowing creation of A outside class B. This is a simple
example of Inversion of Control, the construcion control is taken
outside class B. Of course IoC does not apply to object construction,
but can apply to all kinds of code that couples the calling class to
the implementation of the callee.
</p>


<p>
Inversion of Control, is an abstract concept. In order to implement
it we need to choose a strategy. We are going to choose Dependency
Injection, but could equally choose a <a href="http://en.wikipedia.org/wiki/Service_locator_pattern">Service Locator</a> or
something else as we feel appropriate. (Prism also provides a
Service Locator based IoC via the IServiceLocator interface, a
discussion on DI vs Service Locator can be found <a href="http://www.developmentalmadness.com/archive/2009/11/02/mvvm-with-prism-101-ndash-part-5b-servicelocator-vs-depdency.aspx">here</a>.)
</p>

<p>
Implementing (Constructor) Dependency Injection would result in the
code above looking more like this:
</p>

<div class="org-src-container">

<pre class="src src-csharp"><span class="linenr">25: </span>public interface IA
<span class="linenr">26: </span>{
<span class="linenr">27: </span> void DoSomethingElse();
<span class="linenr">28: </span>}
<span class="linenr">29: </span>public class A : IA
<span class="linenr">30: </span>{
<span class="linenr">31: </span> public A()
<span class="linenr">32: </span> {
<span class="linenr">33: </span> }
<span class="linenr">34: </span>
<span class="linenr">35: </span> public void DoSomethingElse()
<span class="linenr">36: </span> {
<span class="linenr">37: </span> }
<span class="linenr">38: </span>}
<span class="linenr">39: </span>public class B
<span class="linenr">40: </span>{
<span class="linenr">41: </span> IA _a;
<span class="linenr">42: </span>
<span class="linenr">43: </span> public B(IA a)
<span class="linenr">44: </span> {
<span class="linenr">45: </span>  _a = a;
<span class="linenr">46: </span> }
<span class="linenr">47: </span>
<span class="linenr">48: </span> public void DoSomething()
<span class="linenr">49: </span> {
<span class="linenr">50: </span>  _a.DoSomethingElse();
<span class="linenr">51: </span> }
<span class="linenr">52: </span>}
</pre>
</div>

<p>
As you can see, a very simple change and one I am sure many of you
are more than familiar with. This way remove any object creation
and concrete type dependency, allowing us to provide any
implementation of IA to B, B is now no longer responsible for that
decision, which is as it should be in this case.
</p>

<p>
I have specifically chose Constructor DI, as this is the way that
Prism manages DI. We shall now look at how Prism ties this
together.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Prism and the UnityContainer</h3>
<div class="outline-text-3" id="text-2-2">
<p>
In a simple case, something like Prism would be unneccessary to
implement Dependency Injection. Any more than the following would
be unneccessary and overkill:
</p>

<div class="org-src-container">

<pre class="src src-csharp"><span class="linenr">53: </span>IA a = new A();
<span class="linenr">54: </span>B b = new B(a);
<span class="linenr">55: </span>b.DoSomething();
</pre>
</div>

<p>
Not exactly rocket science! But Dependency Injection itself is a
very simple concept, even if there can be a challenge in
recognising when Inversion of Control needs to be applied. However,
in a larger project, where dependencies are numerous and need some
sort of centralised management, often it is neccessary to implement
some form of container to manage the object creation and
injection. These containers are usually known as IoC Containers and
Prism's particular brand is the UnityContainer class. The full
documentation for Prism and Managing dependencies can be found
<a href="http://msdn.microsoft.com/en-us/library/ff921140(v=PandP.40).aspx">here</a>, but I shall give a quick example of using the UnityContainer
to manage the dependency above:
</p>

<p>
firstly we would create an interface for class B as we did with A:
</p>

<div class="org-src-container">

<pre class="src src-csharp"><span class="linenr">56: </span>public interface IB
<span class="linenr">57: </span>{
<span class="linenr">58: </span>void DoSomething();
<span class="linenr">59: </span>}
</pre>
</div>

<p>
We could then use the UnityContainer as follows:
</p>

<div class="org-src-container">

<pre class="src src-csharp"><span class="linenr">60: </span>public class IoCExample
<span class="linenr">61: </span>{
<span class="linenr">62: </span> static void Main()
<span class="linenr">63: </span> {
<span class="linenr">64: </span>  UnityContainer container = new UnityContainer();
<span class="linenr">65: </span>  container.RegisterType&lt;IA, A&gt;();
<span class="linenr">66: </span>  container.RegisterType&lt;IB, B&gt;();
<span class="linenr">67: </span>
<span class="linenr">68: </span>  IB b = container.Resolve&lt;IB&gt;();
<span class="linenr">69: </span>  b.DoSomething();
<span class="linenr">70: </span> }
<span class="linenr">71: </span>}
</pre>
</div>

<p>
In this code, we create the container, register the two types as
the implementation of the interfaces, using RegisterType&lt;&gt;() on the
container. Then, rather than instantiating an instance of B
directly, we resolve, using the container. This allows the
container to inject any dependencies in the constructor of the
registered implementation.
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="todo TODO">TODO</span> A More Realistic Example</h3>
<div class="outline-text-3" id="text-2-3">
<p>
(Migrate from sputnikdev)
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Summary of Dependency Injection</h3>
<div class="outline-text-3" id="text-2-4">
<p>
So to summarise. Inversion of Control is a good thing, it decouples
code and maintains a Separation of Concerns in our code
base. Dependency Injection is one way to achieve this, although
some people prefer the Service Locator Pattern. Prism, or rather
Unity, which is distributed as part of Prism, provides a container
for managing Dependency Injection, which becomes appropriate when
projects get larger and dependencies get more complex.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Bootstrapper</h2>
<div class="outline-text-2" id="text-3">
<p>
From here on in, we will start adding features of Prism to our
example application, hopefully in an order that will represent a
logical sequence of features, starting with features that are most
useful, leading to the more esoteric features. You will soon see why
I say that Prism can be overkill for a lot of applications and as we
progress through these articles, the features being added will need
more thought as to whether your application really needs them or
whether a simpler solution is more sensible.
</p>

<p>
Prism provides a very powerful framework to build an application but
that comes at the cost of complexity.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">The bootstrapper</h3>
<div class="outline-text-3" id="text-3-1">
<p>
A bootstrapper in any application can be considered the entry point
for running the application. In the case of Prism the bootstrapper
is used to configure the IoC container, modules and the shell
(modules and shell will be dealt with in later posts). If you have
read my previous post, you will know about the IoC container in
Prism. If you don't now would be a good time to go and have a look
at it.
</p>

<p>
To use a bootstrapper in Prism, we just override the
UnityBootstrapper class overriding any methods we wish to. As we
progress through this series, we will be adding functionality to
our bootstrapper as we go, but for now, we will just create a
bootstrapper and add the functionality to set up the IoC container
as we did in the previous section.
</p>
</div>

<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="todo TODO">TODO</span> Add mp4</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2016-02-18 Thu 20:50</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
